Delans-TLE/src/Enums/ES_ВидыСтартовыхНастроек/ES_ВидыСтартовыхНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ES_ВидыСтартовыхНастроек</name>
  <enumValues>
    <name>ВидЗабора</name>
  </enumValues>
  <enumValues>
    <name>ВидОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДеньДоставки</name>
  </enumValues>
  <enumValues>
    <name>ДопКассаНП</name>
  </enumValues>
  <enumValues>
    <name>КассаНаложенныхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойГород</name>
  </enumValues>
  <enumValues>
    <name>Плательщик</name>
  </enumValues>
  <enumValues>
    <name>РозничныйПокупатель</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисЛогин</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисПароль</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисСервер</name>
  </enumValues>
  <enumValues>
    <name>УслугаДоставки</name>
  </enumValues>
  <enumValues>
    <name>УслугаРКО</name>
  </enumValues>
  <enumValues>
    <name>УслугаСамовывоза</name>
  </enumValues>
  <enumValues>
    <name>УслугаСтраховки</name>
  </enumValues>
  <enumValues>
    <name>Характеристика</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ИспользоватьГрузы</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
  </enumValues>
  <enumValues>
    <name>Удалить_ИспользоватьЗабор</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
  </enumValues>
  <enumValues>
    <name>Метка1ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка2ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка3ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка1ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка2ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка3ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка1Цвет</name>
  </enumValues>
  <enumValues>
    <name>Метка2Цвет</name>
  </enumValues>
  <enumValues>
    <name>Метка3Цвет</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВремяНаКарте</name>
  </enumValues>
  <enumValues>
    <name>СистемаОпределенияКоординат</name>
  </enumValues>
  <enumValues>
    <name>ПроцентСтраховки</name>
  </enumValues>
  <enumValues>
    <name>Коэффициент</name>
    <comment>Коэффициент расчета объемного веса</comment>
  </enumValues>
  <enumValues>
    <name>ES_Переключатель</name>
  </enumValues>
  <enumValues>
    <name>ES_FTPСервер</name>
  </enumValues>
  <enumValues>
    <name>ES_FTPПорт</name>
  </enumValues>
  <enumValues>
    <name>ES_Пользователь</name>
  </enumValues>
  <enumValues>
    <name>ES_Пароль</name>
  </enumValues>
  <enumValues>
    <name>ES_Каталог</name>
  </enumValues>
  <enumValues>
    <name>ПоискЗаказовПоВхНакладной</name>
    <comment>Истина - При поиске по штрихкоду заказы подбираются по Вх накладной,  Ложь - По НомеруНакладной</comment>
  </enumValues>
  <enumValues>
    <name>АвтоПринятКурьером</name>
    <comment>При создании плана заказам автоматически присваивается статус &quot;Принят курьером&quot;</comment>
  </enumValues>
  <enumValues>
    <name>АвтоПриемЗаборов</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ГруппаДляГрузов</name>
  </enumValues>
  <enumValues>
    <name>Метка1Код</name>
  </enumValues>
  <enumValues>
    <name>Метка2Код</name>
  </enumValues>
  <enumValues>
    <name>Метка3Код</name>
  </enumValues>
  <enumValues>
    <name>КодСкладДвери</name>
  </enumValues>
  <enumValues>
    <name>КодДвериДвери</name>
  </enumValues>
  <enumValues>
    <name>КодДвериДвериУпрощенный</name>
  </enumValues>
  <enumValues>
    <name>КодСамовывоз</name>
  </enumValues>
  <enumValues>
    <name>КодДвериТерминал</name>
  </enumValues>
  <enumValues>
    <name>КодТерминалТерминал</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураДляЧека</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьНоменклатуруДляЧеков</name>
  </enumValues>
  <enumValues>
    <name>ВидДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьДДуНаКарте</name>
  </enumValues>
  <enumValues>
    <name>УслугаСбора</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаОсновная</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаПроблема</name>
  </enumValues>
  <enumValues>
    <name>КодТерминалПВЗ</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляСбора</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ТокенБотаДляТелеграм</name>
  </enumValues>
  <enumValues>
    <name>ИДЧатаДляТелеграм</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляВидаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ЛогинПользователяИБ</name>
  </enumValues>
  <enumValues>
    <name>ПарольПользователяИБ</name>
  </enumValues>
  <enumValues>
    <name>АдресСклада</name>
  </enumValues>
  <enumValues>
    <name>АдресСкладаДолгота</name>
  </enumValues>
  <enumValues>
    <name>АдресСкладаШирота</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/CommonModules/ES_ТелеграмAPI/Module.bsl
Процедура ОтправитьВТелеграм(СообщитьТекст, МасивСообщений) Экспорт
	
	//ЭР Несторук С.И. 20.06.2019 22:34:07 {
	Если НЕ ES_БиллингСервер.ПроверкаДоступностиУслугиТелеграмм() Тогда
		Сообщить("Не подлючена услуга для работы с Telegram");
		Возврат;
	КонецЕсли;
	//}ЭР Несторук С.И.
		
	//ТокенБота 			= "725043174:AAHedfPOQK3zOIJIblIoaRqoNc1lcT4fVIQ";
	ТокенБота = ЗапросТокенаБота();
	
	//нужно использовать прокси сервер
	ИспользоватьПрокси	= Истина;
	ПроксиСервер		= "socks5://s6.esit.info"; //192.169.197.146";//
	//ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows, Новый СертификатыУдостоверяющихЦентровWindows); 
	
	ИнтернетПрокси = Новый ИнтернетПрокси;
	//ИнтернетПрокси.Установить("https", ПроксиСервер, 31080, "OlegSA", "fff4sfdf");
	ИнтернетПрокси.Установить("https", ПроксиСервер, 31080, "Delans", "Delans_2019");
	
	Если МасивСообщений <> Неопределено Тогда
		Для каждого Элемент из МасивСообщений Цикл
			
			//пока в телеграм не вернется корректный ответ он будет посылать запросы на адресс вебхука
			СимволПереноса = СтрНайти(Элемент, Символы.ПС);
			//НазваниеДок = Сред(Элемент, 1, 3);
			ДокУникИдент = Сред(Элемент, 1, СимволПереноса-1);
			
			ПроизвольныйТекст = СтрЗаменить(Элемент, Сред(Элемент, 1, СимволПереноса), "");
			
			
			//Создаем структуру для кнопки, она должна быть в формате json
			клСтруктура = Новый Структура;
			мСтрок = Новый Массив;
			мКнопок = Новый Массив;
			мКнопок.Добавить(Новый Структура("text, callback_data", "Принять", "1" + ДокУникИдент));
			
			мСтрок.Добавить(мКнопок);    
			
			клСтруктура.Вставить("inline_keyboard",мСтрок);
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON,клСтруктура,,);
			
			Клавиатура = ЗаписьJSON.Закрыть();
			
			//Получить ИдЧата для отправки сообщения в нужный чат
			ИДЧата = ЗапросИДЧатаДляБота();
			
			
			//МасивСообщений = ОтправитьВТелеграмНаСервере();
			
			Соединение  =  Новый HTTPСоединение("api.telegram.org",443,,,ИнтернетПрокси,,Новый ЗащищенноеСоединениеOpenSSL());
			ПолучениеЗапрос = "bot"+ТокенБота+"/sendMessage?chat_id="+ИдЧата+"&text="+ПроизвольныйТекст + "&reply_markup=" +Клавиатура;
			Запрос = Новый HTTPЗапрос(ПолучениеЗапрос);
			Ответ = Соединение.Получить(Запрос);
			
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
			Результат = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
		КонецЦикла;
		
		Сообщить(СообщитьТекст);
		//Возврат Ответ;
	КонецЕсли;
	
	
КонецПроцедуры

Функция ЗапросТокенаБота()
	
	ТокенБота = ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.ТокенБотаДляТелеграм);
	
	Если Не ЗначениеЗаполнено(ТокенБота) Тогда
		
		Сообщить("Заполните в стартовых настройках значение токена бота");
		
	КонецЕсли;
		
	Возврат ТокенБота;
	
КонецФункции

	
Функция ЗапросИДЧатаДляБота()
	
	ИДЧата = ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.ИДЧатаДляТелеграм);
	Если Не ЗначениеЗаполнено(ИДЧата) Тогда
		Сообщить("Отправте боту команду /start с вашего чата или заполните в стартовых настройках");
	КонецЕсли;
	Возврат ИДЧата;
	
	
КонецФункции

//Запрос в базу для редактирования или создания документов
//
//Запрос - запрос от телеграмм
//Область - область разделения данных
//Пользователь - пользователь ИБ
//Параль - для входа в ИБ
//ШаблонHTTPСервиса -
//ДопПараметры - ИденификаторТелеграм или УникальныйИдентификаторДокумента
Функция ЗапросВРабочуюБазу(Запрос, ШаблонHTTPСервиса, ТелоЗапроса) Экспорт
	
	ЛогинПользователя = ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.ЛогинПользователяИБ);
	Пароль = ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.ПарольПользователяИБ);
	ТекОбласть = Строка(ПараметрыСеанса.ОбластьДанныхОсновныеДанные);
	
	// Создаем новое HTTP соединение с указанием сервера
	// Последний параметр отвечает за использование защищенного соединения
	ИмяСервера = "unf.42clouds.com";
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows, Новый СертификатыУдостоверяющихЦентровWindows);
	HTTP = Новый HTTPСоединение(ИмяСервера,443,ЛогинПользователя,Пароль,,,ЗащищенноеСоединение);
	// Получим временный файл для передачи в теле POST запроса
	ФайлТелаЗапроса = ПолучитьИмяВременногоФайла();
	// Запишем в файл содержимое тела запроса (текст)
	ТекстФайл = Новый ТекстовыйДокумент;
	ТекстФайл.УстановитьТекст(ТелоЗапроса);
	ТекстФайл.Записать(ФайлТелаЗапроса, "CESU-8");
	// Получим размер данных для передачи в заголовок
	ФайлНаОтправку = Новый Файл(ФайлТелаЗапроса);
	РазмерФайлаНаОтправку = XMLСтрока(ФайлНаОтправку.Размер());
	// Получим временный файл — тело ответа POST запроса
	ФайлРезультат = ПолучитьИмяВременногоФайла();
	// Заголовок создадим в виде соответствия
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	// Передаем в заголовках размер и тип данных на отправку
	ЗаголовокЗапросаHTTP.Вставить("Content-Length", РазмерФайлаНаОтправку);
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	// Отсылаем POST запрос на обработку.
	// СсылкаНаРесурс — ссылка на веб-сервер (страницу), к которой посылается POST запрос
	СсылкаНаРесурс = "unf_base1/"+ТекОбласть+"/hs/Forbot1c/" + ШаблонHTTPСервиса;//1059
	HTTP.ОтправитьДляОбработки(ФайлТелаЗапроса, СсылкаНаРесурс, ФайлРезультат);
	// Получим ответ
	ТекстовыйФайлОтвета = Новый ТекстовыйДокумент;
	ТекстовыйФайлОтвета.Прочитать(ФайлРезультат, КодировкаТекста.UTF8);
	СтрокаОтветаСервера = ТекстовыйФайлОтвета.ПолучитьТекст();
	Возврат СтрокаОтветаСервера; 
	
КонецФункции

Функция ПрочитатьОтветJSON(Запрос) Экспорт
	//Получаем данные сообщений
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку(); 
	
	//Читаем полученные данный форматаJSON
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	
	Возврат Результат;
	
КонецФункции
